---
kind: other
id: Methods.T:Autodesk.Revit.DB.LineAndTextAttrSymbol
source: html/28ba6cb1-333f-5c82-c09e-62b41a6e7181.htm
---
# LineAndTextAttrSymbol Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.